// Однострочный комментарий 

/* Многострочный комментарий. Можно 
закомментировать
несколько строк 
кода или текста*/

// Быстро закомментировать можно 
// сочетанием клавиш "cmd + /" , предварительно 
// выделив нужный код или текст

// Задача 1
// Напишите программу, которая на вход принимает два чиста и проверяет,
//является ли первое число квадратом второго.
/*Console.WriteLine("Введите первое число: ");
int Nam1 = int.Parse(Console.ReadLine()!); // добавил !

Console.WriteLine("Введите второе число: ");
int Nam2 = int.Parse(Console.ReadLine()!); //int.Parse - конвертирование строки в тип int

if (Math.Pow(Nam2, 2) == Nam1)//Math - библиотека позволяющяя работать с различными  математическими методами. Pow - степень
{
    Console.WriteLine("Первое число является квадратом второго!");

}
else
{
    Console.WriteLine("Первое число не является квадратом второго!");
}
*/

//Задача 2
