// // Задача №1 в классе------------------------------------------------------------------------------------------------------------------
// // Задайте массив из 12 элементов, заполненный случайными числами из промежутка [-9, 9]
// // Найдите сумму отрицательных и пложительных элементов.

// //Метод создания массива  по параметрам______________________________________________________________________
int[] GitArray(int size, int minValue, int maxValue)
{
    int[] res = new int[size];
    for (int i = 0; i < size; i++)
    {
        res[i] = new Random().Next(minValue, maxValue + 1);
    }
    return res;
}
// //________________________________________________________________________________________________________
// //Вызов метода создания массива_____________________________________________________________________________________
// int[] array = GitArray(12, -9, 9);
// Console.WriteLine(String.Join("  ", array));
// //________________________________________________________________________________________________________
// //Складываем положительные и отрицательные цифры__________________________________________________________
// int negativeSum = 0;  // создаем переменные в еоторых будем суммировать
// int positiveSum = 0;  // отрицательные и положительные числа.

// for (int i = 0; i < array.Length; i++)
// {
//     if(array[i] < 0)
//     {
//         negativeSum += array[i];
//     }
//     else
//     {
//         positiveSum += array[i];
//     }
// }
// Console.WriteLine($"Positive Sum =  {positiveSum}\nNegative Sum = {negativeSum}");
// //______________________________________________________________________________________________________


// Задача 2 в классе:--------------------------------------------------------------------------------------------------------------------
// Напишите программу замена элементов массива: 
// положительные элементы замените на соответствующие отрицательные, и наоборот.

// [-4, -8, 8, 2] -> [4, 8, -8, -2]

// int[] arr = GitArray(12, -92, 93);
// Console.WriteLine(String.Join("   ", arr));


//Вариант 1_______________________________________________________________
//     for (int i = 0; i < arr.Length; i++)
//     {
//        arr[i] = arr[i] *= -1;
//     }
// Console.WriteLine(String.Join("   ", arr));
//________________________________________________________________________

////Вариант 2_______________________________________________________________
// void ExchangeArray( int [] arr1)
// {
//     for (int i = 0; i < arr1.Length; i++)
//     {
//         arr1[i] *= -1;
//     }
//      Console.WriteLine(String.Join("   ", arr1));
// }
// ExchangeArray(arr);
////________________________________________________________________________

// //Вариант 3_______________________________________________________________
// int[] ExchangeArr(int[] rez)
// {   
//     for (int i = 0; i < rez.Length; i++)
//     {
//         rez[i] = rez[i] * -1;
//     }
//     return rez;
// }    
// Console.WriteLine(String.Join("   ", ExchangeArr(arr)));
// //________________________________________________________________________


// Задача 3 в клсаасе:-------------------------------------------------------------------------------------------------------------
//Задайте массив. Напишите программу, которая определяет, присутствует ли заданное число в массиве.
// 4; массив [6, 7, 19, 345, 3] -> нет
// 3; массив [6, 7, 19, 345, 3] -> да

int[] arra = GitArray(12, -5, 5);
Console.WriteLine($"Случайный массив -> {String.Join("   ", arra)}");

int A = new Random().Next(-5, 5);
Console.WriteLine($"Случайное, искомое число -> {A}");

NumberSearch(arra);



void NumberSearch(int[]arra1)
{
    int count = 0;
    for (int i = 0; i < arra1.Length; i++)
    {
        if(arra1[i] == A)
        {   
            count++;
        }
    }
    if(count == 0)
    {
        Console.WriteLine($"В массиве [{String.Join(", ", arra1)}]-> встретилось {count} раз(а) -> нет");
    }
    else
    {
        Console.WriteLine($"В массиве [{String.Join(", ", arra1)}] -> встретилось {count} раз(а) -> да");
    }
}
