// Задача №1 в классе--------------------------------------------------------------
// Задайте массив из 12 элементов, заполненный случайными числами из промежутка [-9, 9]
// Найдите сумму отрицательных и пложительных элементов.

//Метод создания массива  по параметрам______________________________________________________________________
int[] GitArray(int size, int minValue, int maxValue)
{
    int[] res = new int[size];
    for (int i = 0; i < size; i++)
    {
        res[i] = new Random().Next(minValue, maxValue + 1);
    }
    return res;
}
//________________________________________________________________________________________________________
//Вызов метода создания массива_____________________________________________________________________________________
int[] array = GitArray(12, -9, 9);
Console.WriteLine(String.Join("  ", array));
//________________________________________________________________________________________________________
//Складываем положительные и отрицательные цифры__________________________________________________________
int negativeSum = 0;  // создаем переменные в еоторых будем суммировать
int positiveSum = 0;  // отрицательные и положительные числа.

for (int i = 0; i < array.Length; i++)
{
    if(array[i] < 0)
    {
        negativeSum = negativeSum + array[i];
    }
    else
    {
        positiveSum = positiveSum + array[i];
    }
}
Console.WriteLine($"Positive Sum =  {positiveSum}\nNegative Sum = {negativeSum}");
//______________________________________________________________________________________________________
 